[
    {
        "identifier": "nola-travel-2022",
        "name": "Nola's Mobile Travel App - Destination Sample (2022)",
        "excerpt": "Travel destination detail page created with SwiftUI. Based on Nola Riska's portfolio.",
        "description": "<p><strong>Repository Link</strong>: <a href=\"https://github.com/ArdoThenardo/NolaTravelApp\">Source code of this sample app is available here</a>.</p><p><strong>Design Link</strong>: <a href=\"https://www.behance.net/gallery/144080577/Travel-Mobile-App\">You can check interface design here</a>.</p><p>Travel Mobile App is a mobile application concept made by Nola Riska as one of her many portfolios.  In her original design, this app concept have onboarding, home, and destination detail page. But in this sample app, I only chose the destination detail page to implement. The purpose of this implementation is to learn how to construct user interface for iOS platform with SwiftUI.</p><p>When I was translating Nola's design into iOS app, I took several liberties from her design such as add navigation bar with back button and share button. I also implemented my own take or design for contents inside Review tab and Photo tab.</p><p>Inside Review tab, user could see list of reviews written by other travelers. Each review have traveler's username, review text, rating, and date.</p><p>For Photo tab, I using WaterfallGrid library by Paolo Leonardi to implement waterfall layout for photos.</p><p>NOTE:<br>- Device Mockup created from <a href=\"https://deviceframes.com/templates/iphone-13\">iPhone mockups</a>.</p>",
        "note": "",
        "images":
            [
                {
                    "url": "img/nola-travel-2022/nola-travel-img1.jpg",
                    "caption": "General interface of travel destination detail."
                },
                {
                    "url": "img/nola-travel-2022/nola-travel-img2.jpg",
                    "caption": "User could see photos of location and read reviews from other travelers."
                }
            ],
        "cover": "img/nola-travel-2022/nola-travel-cover.jpg"
    }
]